[Killed] BlockStatement
src/services/AuthService.ts:15:100
   ) {}
 
   /** Registers a new account after validating password policy and uniqueness. */
-  public async registerUser(email: string, password: string, correlationId: string): Promise<User> {
-    this.validatePasswordPolicy(password);
-    const normalizedEmail = email.trim().toLowerCase();
-
-    const existing = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
-      normalizedEmail,
-    ]);
-    if (existing.rows.length > 0) {
-      throw new Error('duplicate_email');
-    }
-
-    const passwordHash = await this.cryptoService.hashPassword(password);
-    const result = await dbPool.query<User>(
-      `INSERT INTO users(email, password_hash, status, password_changed_at)
-       VALUES ($1,$2,'active',NOW())
-       RETURNING *`,
-      [normalizedEmail, passwordHash],
-    );
-
-    await this.logEvent(result.rows[0].id, 'registration', 'success', correlationId, null);
-    return result.rows[0];
-  }
+  public async registerUser(email: string, password: string, correlationId: string): Promise<User> {}
 
   /** Authenticates a user and issues JWT plus session record when valid. */
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] MethodExpression
src/services/AuthService.ts:17:29
   /** Registers a new account after validating password policy and uniqueness. */
   public async registerUser(email: string, password: string, correlationId: string): Promise<User> {
     this.validatePasswordPolicy(password);
-    const normalizedEmail = email.trim().toLowerCase();
+    const normalizedEmail = email.trim().toUpperCase();
 
     const existing = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "SELECT * FROM users WHERE email = $1 LIMIT 1", ["new.user@example.com"]
Received
->     1
          "SELECT * FROM users WHERE email = $1 LIMIT 1",
          Array [

[Killed] MethodExpression
src/services/AuthService.ts:17:29
   /** Registers a new account after validating password policy and uniqueness. */
   public async registerUser(email: string, password: string, correlationId: string): Promise<User> {
     this.validatePasswordPolicy(password);
-    const normalizedEmail = email.trim().toLowerCase();
+    const normalizedEmail = email.toLowerCase();
 
     const existing = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "SELECT * FROM users WHERE email = $1 LIMIT 1", ["new.user@example.com"]
Received
->     1
          "SELECT * FROM users WHERE email = $1 LIMIT 1",
          Array [

[Killed] ConditionalExpression
src/services/AuthService.ts:22:9
     const existing = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
       normalizedEmail,
     ]);
-    if (existing.rows.length > 0) {
+    if (true) {
       throw new Error('duplicate_email');
     }
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: duplicate_email

[Killed] ConditionalExpression
src/services/AuthService.ts:22:9
     const existing = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
       normalizedEmail,
     ]);
-    if (existing.rows.length > 0) {
+    if (false) {
       throw new Error('duplicate_email');
     }
killedBy: AuthService rejects duplicate registrations before inserting a user
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "duplicate_email"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      76 |        VALUES ($1,$2,'active',NOW())
      77 |        RETURNING *`), stryMutAct_9fa48("56") ? [] : (stryCov_9fa48("56"), [normalizedEmail, passwordHash]));
    > 78 |       await this.logEvent(result.rows[0].id, stryMutAct_

[Killed] StringLiteral
src/services/AuthService.ts:23:23
       normalizedEmail,
     ]);
     if (existing.rows.length > 0) {
-      throw new Error('duplicate_email');
+      throw new Error("");
     }
 
killedBy: AuthService rejects duplicate registrations before inserting a user
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "duplicate_email"
Received message:   ""

      69 |         } else {
      70 |           stryCov_9fa48("53");
    > 71 |           throw new Error(stryMutAct_9fa48("54") ? "" : (stryCov_9fa48("54"), 'duplicate_email'));

[Killed] StringLiteral
src/services/AuthService.ts:28:7
 
     const passwordHash = await this.cryptoService.hashPassword(password);
     const result = await dbPool.query<User>(
-      `INSERT INTO users(email, password_hash, status, password_changed_at)
-       VALUES ($1,$2,'active',NOW())
-       RETURNING *`,
+      ``,
       [normalizedEmail, passwordHash],
     );
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "INSERT INTO users"
Received string:    ""

[Survived] StringLiteral
src/services/AuthService.ts:34:44
       [normalizedEmail, passwordHash],
     );
 
-    await this.logEvent(result.rows[0].id, 'registration', 'success', correlationId, null);
+    await this.logEvent(result.rows[0].id, "", 'success', correlationId, null);
     return result.rows[0];
   }

[Survived] MethodExpression
src/services/AuthService.ts:46:29
     userAgent: string | null;
     correlationId: string;
   }): Promise<LoginResponse> {
-    const normalizedEmail = params.email.trim().toLowerCase();
+    const normalizedEmail = params.email.toLowerCase();
     const userResult = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
       normalizedEmail,

[Survived] MethodExpression
src/services/AuthService.ts:46:29
     userAgent: string | null;
     correlationId: string;
   }): Promise<LoginResponse> {
-    const normalizedEmail = params.email.trim().toLowerCase();
+    const normalizedEmail = params.email.trim().toUpperCase();
     const userResult = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
       normalizedEmail,

[Survived] StringLiteral
src/services/AuthService.ts:47:49
     correlationId: string;
   }): Promise<LoginResponse> {
     const normalizedEmail = params.email.trim().toLowerCase();
-    const userResult = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
+    const userResult = await dbPool.query<User>("", [
       normalizedEmail,
     ]);

[Killed] BlockStatement
src/services/AuthService.ts:52:16
     ]);
     const user = userResult.rows[0];
 
-    if (!user) {
-      await this.logEvent(null, 'login_failure', 'failure', params.correlationId, 'invalid_credentials');
-      throw new Error('invalid_credentials');
-    }
+    if (!user) {}
 
     this.enforceProgressiveLockout(user);
killedBy: AuthService rejects missing users during login and logs the failure
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "invalid_credentials"
Received message:   "Cannot read properties of undefined (reading 'status')"

      208 |     } else {
      209 |       stryCov_9fa48("126");
    > 210 |       if (stryMutAct_9fa48("129") ? user.status !== 'suspended' : stryMutAct_9fa48("128") ? false : stryMutAct_9fa48("127") ? true : (stryCov_9fa48("127

[Killed] BooleanLiteral
src/services/AuthService.ts:60:9
     this.enforceProgressiveLockout(user);
 
     const valid = await this.cryptoService.verifyPassword(params.password, user.password_hash);
-    if (!valid) {
+    if (valid) {
       await this.recordFailedLogin(user.id, params.correlationId);
       throw new Error('invalid_credentials');
killedBy: AuthService retries login failure tracking without lockout when attempts stay below threshold
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "invalid_credentials"
Received message:   "stale_session_detected"

      134 |             correlationId: params.correlationId
      135 |           }));
    > 136 |           throw new Error(stryMutAct_9fa48("85") ? "" : (stryCov_9fa48("85"), 'stale_session_detected'));

[Killed] ConditionalExpression
src/services/AuthService.ts:60:9
     this.enforceProgressiveLockout(user);
 
     const valid = await this.cryptoService.verifyPassword(params.password, user.password_hash);
-    if (!valid) {
+    if (true) {
       await this.recordFailedLogin(user.id, params.correlationId);
       throw new Error('invalid_credentials');
killedBy: AuthService logs in successfully, issues a session, and returns a signed token payload
statusReason: Error: invalid_credentials

[Killed] BlockStatement
src/services/AuthService.ts:76:39
       [user.id, user.password_changed_at],
     );
 
-    if (staleSession.rows.length > 0) {
-      await this.sessionManager.revokeSession(staleSession.rows[0].jti, {
-        userId: user.id,
-        correlationId: params.correlationId,
-      });
-      throw new Error('stale_session_detected');
-    }
+    if (staleSession.rows.length > 0) {}
 
     await dbPool.query(
killedBy: AuthService revokes stale sessions before accepting a login
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] EqualityOperator
src/services/AuthService.ts:76:9
       [user.id, user.password_changed_at],
     );
 
-    if (staleSession.rows.length > 0) {
+    if (staleSession.rows.length >= 0) {
       await this.sessionManager.revokeSession(staleSession.rows[0].jti, {
         userId: user.id,
killedBy: AuthService logs in successfully, issues a session, and returns a signed token payload
statusReason: TypeError: Cannot read properties of undefined (reading 'jti')

[Survived] ObjectLiteral
src/services/AuthService.ts:98:44
       jti,
     });
 
-    await this.sessionManager.issueSession({
-      userId: user.id,
-      jti,
-      tokenHash: this.cryptoService.hashToken(token),
-      ipAddress: params.ipAddress,
-      userAgent: params.userAgent,
-    });
+    await this.sessionManager.issueSession({});
 
     await this.logEvent(user.id, 'login_success', 'success', params.correlationId, null);

[Survived] StringLiteral
src/services/AuthService.ts:106:51
       userAgent: params.userAgent,
     });
 
-    await this.logEvent(user.id, 'login_success', 'success', params.correlationId, null);
+    await this.logEvent(user.id, 'login_success', "", params.correlationId, null);
 
     return {

[Killed] ObjectLiteral
src/services/AuthService.ts:108:12
 
     await this.logEvent(user.id, 'login_success', 'success', params.correlationId, null);
 
-    return {
-      access_token: token,
-      token_type: 'Bearer',
-      expires_in: 24 * 60 * 60,
-      user: {
-        id: user.id,
-        email: user.email,
-      },
-    };
+    return {};
   }
 
killedBy: AuthService logs in successfully, issues a session, and returns a signed token payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bearer"
Received: undefined

[Survived] ArithmeticOperator
src/services/AuthService.ts:111:19
     return {
       access_token: token,
       token_type: 'Bearer',
-      expires_in: 24 * 60 * 60,
+      expires_in: 24 * 60 / 60,
       user: {
         id: user.id,

[Survived] ArithmeticOperator
src/services/AuthService.ts:111:19
     return {
       access_token: token,
       token_type: 'Bearer',
-      expires_in: 24 * 60 * 60,
+      expires_in: 24 / 60 * 60,
       user: {
         id: user.id,

[Killed] BlockStatement
src/services/AuthService.ts:120:94
   }
 
   /** Revokes currently authenticated session. */
-  public async logoutUser(jti: string, userId: number, correlationId: string): Promise<void> {
-    await this.sessionManager.revokeSession(jti, {
-      userId,
-      correlationId,
-    });
-    await this.logEvent(userId, 'logout', 'success', correlationId, null);
-  }
+  public async logoutUser(jti: string, userId: number, correlationId: string): Promise<void> {}
 
   /** Enforces the configured password policy from specification. */
killedBy: AuthService revokes the current session on logout and writes an event
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
src/services/AuthService.ts:125:33
       userId,
       correlationId,
     });
-    await this.logEvent(userId, 'logout', 'success', correlationId, null);
+    await this.logEvent(userId, "", 'success', correlationId, null);
   }
 

[Killed] BlockStatement
src/services/AuthService.ts:129:57
   }
 
   /** Enforces the configured password policy from specification. */
-  public validatePasswordPolicy(password: string): void {
-    const hasMin = password.length >= 12;
-    const hasUpper = /[A-Z]/.test(password);
-    const hasLower = /[a-z]/.test(password);
-    const hasNumber = /\d/.test(password);
-    const hasSymbol = /[^A-Za-z0-9]/.test(password);
-
-    if (!hasMin || !hasUpper || !hasLower || !hasNumber || !hasSymbol) {
-      throw new Error('invalid_password');
-    }
-  }
+  public validatePasswordPolicy(password: string): void {}
 
   /** Applies lockout rules and rejects if user is currently blocked. */
killedBy: AuthService rejects passwords that fail the policy checks without querying storage
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "invalid_password"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      64 |       const normalizedEmail = stryMutAct_9fa48("46") ? email.toLowerCase() : stryMutAct_9fa48("45") ? email.trim().toUpperCase() : (stryCov_9fa48("45", "46"), email.trim().toLowerCase());
      65 |       const existing = a

[Killed] EqualityOperator
src/services/AuthService.ts:130:20
 
   /** Enforces the configured password policy from specification. */
   public validatePasswordPolicy(password: string): void {
-    const hasMin = password.length >= 12;
+    const hasMin = password.length < 12;
     const hasUpper = /[A-Z]/.test(password);
     const hasLower = /[a-z]/.test(password);
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: invalid_password

[Killed] ConditionalExpression
src/services/AuthService.ts:130:20
 
   /** Enforces the configured password policy from specification. */
   public validatePasswordPolicy(password: string): void {
-    const hasMin = password.length >= 12;
+    const hasMin = false;
     const hasUpper = /[A-Z]/.test(password);
     const hasLower = /[a-z]/.test(password);
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: invalid_password

[Killed] ConditionalExpression
src/services/AuthService.ts:136:9
     const hasNumber = /\d/.test(password);
     const hasSymbol = /[^A-Za-z0-9]/.test(password);
 
-    if (!hasMin || !hasUpper || !hasLower || !hasNumber || !hasSymbol) {
+    if (true) {
       throw new Error('invalid_password');
     }
killedBy: PasswordValidation accepts a compliant password at the exact 12-character boundary
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "invalid_password"

      196 |         } else {
      197 |           stryCov_9fa48("124");
    > 198 |           throw new Error(stryMutAct_9fa48("125") ? "" : (stryCov_9fa48("125"), 'invalid_password'));

[Killed] LogicalOperator
src/services/AuthService.ts:136:9
     const hasNumber = /\d/.test(password);
     const hasSymbol = /[^A-Za-z0-9]/.test(password);
 
-    if (!hasMin || !hasUpper || !hasLower || !hasNumber || !hasSymbol) {
+    if ((!hasMin || !hasUpper) && !hasLower || !hasNumber || !hasSymbol) {
       throw new Error('invalid_password');
     }
killedBy: PasswordValidation rejects short passwords
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "invalid_password"

Received function did not throw

[Killed] BlockStatement
src/services/AuthService.ts:142:54
   }
 
   /** Applies lockout rules and rejects if user is currently blocked. */
-  public enforceProgressiveLockout(user: User): void {
-    if (user.status === 'suspended') {
-      throw new Error('account_suspended');
-    }
-
-    if (user.status === 'locked' && user.lockout_until && new Date(user.lockout_until) > new Date()) {
-      throw new Error('account_locked');
-    }
-  }
+  public enforceProgressiveLockout(user: User): void {}
 
   private async recordFailedLogin(userId: number, correlationId: string): Promise<void> {
killedBy: AuthService rejects suspended users before checking passwords
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "account_suspended"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      125 |        ORDER BY issued_at ASC
      126 |        LIMIT 1`), stryMutAct_9fa48("78") ? [] : (stryCov_9fa48("78"), [user.id, user.password_changed_at]));
    > 127 |       if (stryMutAct_9fa48("82") ? staleSession.rows.lengt

[Killed] BlockStatement
src/services/AuthService.ts:143:38
 
   /** Applies lockout rules and rejects if user is currently blocked. */
   public enforceProgressiveLockout(user: User): void {
-    if (user.status === 'suspended') {
-      throw new Error('account_suspended');
-    }
+    if (user.status === 'suspended') {}
 
     if (user.status === 'locked' && user.lockout_until && new Date(user.lockout_until) > new Date()) {
killedBy: AuthService rejects suspended users before checking passwords
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "account_suspended"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      125 |        ORDER BY issued_at ASC
      126 |        LIMIT 1`), stryMutAct_9fa48("78") ? [] : (stryCov_9fa48("78"), [user.id, user.password_changed_at]));
    > 127 |       if (stryMutAct_9fa48("82") ? staleSession.rows.lengt

[Killed] ConditionalExpression
src/services/AuthService.ts:143:9
 
   /** Applies lockout rules and rejects if user is currently blocked. */
   public enforceProgressiveLockout(user: User): void {
-    if (user.status === 'suspended') {
+    if (false) {
       throw new Error('account_suspended');
     }
killedBy: AuthService rejects suspended users before checking passwords
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "account_suspended"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      125 |        ORDER BY issued_at ASC
      126 |        LIMIT 1`), stryMutAct_9fa48("78") ? [] : (stryCov_9fa48("78"), [user.id, user.password_changed_at]));
    > 127 |       if (stryMutAct_9fa48("82") ? staleSession.rows.lengt

[Killed] StringLiteral
src/services/AuthService.ts:144:23
   /** Applies lockout rules and rejects if user is currently blocked. */
   public enforceProgressiveLockout(user: User): void {
     if (user.status === 'suspended') {
-      throw new Error('account_suspended');
+      throw new Error("");
     }
 
killedBy: AuthService rejects suspended users before checking passwords
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "account_suspended"
Received message:   ""

      213 |         } else {
      214 |           stryCov_9fa48("131");
    > 215 |           throw new Error(stryMutAct_9fa48("132") ? "" : (stryCov_9fa48("132"), 'account_suspended'));

[Killed] ConditionalExpression
src/services/AuthService.ts:147:9
       throw new Error('account_suspended');
     }
 
-    if (user.status === 'locked' && user.lockout_until && new Date(user.lockout_until) > new Date()) {
+    if (false) {
       throw new Error('account_locked');
     }
killedBy: AuthService rejects locked users whose lockout window is still active
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "account_locked"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      125 |        ORDER BY issued_at ASC
      126 |        LIMIT 1`), stryMutAct_9fa48("78") ? [] : (stryCov_9fa48("78"), [user.id, user.password_changed_at]));
    > 127 |       if (stryMutAct_9fa48("82") ? staleSession.rows.length <

[Killed] EqualityOperator
src/services/AuthService.ts:147:59
       throw new Error('account_suspended');
     }
 
-    if (user.status === 'locked' && user.lockout_until && new Date(user.lockout_until) > new Date()) {
+    if (user.status === 'locked' && user.lockout_until && new Date(user.lockout_until) <= new Date()) {
       throw new Error('account_locked');
     }
killedBy: AuthService rejects locked users whose lockout window is still active
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "account_locked"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      125 |        ORDER BY issued_at ASC
      126 |        LIMIT 1`), stryMutAct_9fa48("78") ? [] : (stryCov_9fa48("78"), [user.id, user.password_changed_at]));
    > 127 |       if (stryMutAct_9fa48("82") ? staleSession.rows.length <

[Survived] ArrayDeclaration
src/services/AuthService.ts:153:94
   }
 
   private async recordFailedLogin(userId: number, correlationId: string): Promise<void> {
-    const userResult = await dbPool.query<User>('SELECT * FROM users WHERE id = $1 LIMIT 1', [userId]);
+    const userResult = await dbPool.query<User>('SELECT * FROM users WHERE id = $1 LIMIT 1', []);
     const user = userResult.rows[0];
     if (!user) {

[Killed] BooleanLiteral
src/services/AuthService.ts:155:9
   private async recordFailedLogin(userId: number, correlationId: string): Promise<void> {
     const userResult = await dbPool.query<User>('SELECT * FROM users WHERE id = $1 LIMIT 1', [userId]);
     const user = userResult.rows[0];
-    if (!user) {
+    if (user) {
       return;
     }
killedBy: AuthService retries login failure tracking without lockout when attempts stay below threshold
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/services/AuthService.ts:155:9
   private async recordFailedLogin(userId: number, correlationId: string): Promise<void> {
     const userResult = await dbPool.query<User>('SELECT * FROM users WHERE id = $1 LIMIT 1', [userId]);
     const user = userResult.rows[0];
-    if (!user) {
+    if (true) {
       return;
     }
killedBy: AuthService retries login failure tracking without lockout when attempts stay below threshold
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
src/services/AuthService.ts:159:26
       return;
     }
 
-    const nextAttempts = user.failed_login_attempts + 1;
+    const nextAttempts = user.failed_login_attempts - 1;
     let nextStatus: 'active' | 'locked' = 'active';
     let lockoutUntil: Date | null = null;
killedBy: AuthService retries login failure tracking without lockout when attempts stay below threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
src/services/AuthService.ts:165:9
     let lockoutCount24h = user.lockout_count_24h;
     let lockoutWindowStart = user.lockout_window_start;
 
-    if (nextAttempts >= 5) {
+    if (nextAttempts > 5) {
       nextStatus = 'locked';
 
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "locked"
Received: "active"

[Killed] ConditionalExpression
src/services/AuthService.ts:165:9
     let lockoutCount24h = user.lockout_count_24h;
     let lockoutWindowStart = user.lockout_window_start;
 
-    if (nextAttempts >= 5) {
+    if (false) {
       nextStatus = 'locked';
 
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "locked"
Received: "active"

[Killed] StringLiteral
src/services/AuthService.ts:166:20
     let lockoutWindowStart = user.lockout_window_start;
 
     if (nextAttempts >= 5) {
-      nextStatus = 'locked';
+      nextStatus = "";
 
       if (!lockoutWindowStart || new Date(lockoutWindowStart).getTime() < Date.now() - 24 * 60 * 60 * 1000) {
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "locked"
Received: ""

[Killed] BlockStatement
src/services/AuthService.ts:168:109
     if (nextAttempts >= 5) {
       nextStatus = 'locked';
 
-      if (!lockoutWindowStart || new Date(lockoutWindowStart).getTime() < Date.now() - 24 * 60 * 60 * 1000) {
-        lockoutWindowStart = new Date();
-        lockoutCount24h = 1;
-      } else {
+      if (!lockoutWindowStart || new Date(lockoutWindowStart).getTime() < Date.now() - 24 * 60 * 60 * 1000) {} else {
         lockoutCount24h += 1;
       }
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/services/AuthService.ts:168:11
     if (nextAttempts >= 5) {
       nextStatus = 'locked';
 
-      if (!lockoutWindowStart || new Date(lockoutWindowStart).getTime() < Date.now() - 24 * 60 * 60 * 1000) {
+      if (!lockoutWindowStart && new Date(lockoutWindowStart).getTime() < Date.now() - 24 * 60 * 60 * 1000) {
         lockoutWindowStart = new Date();
         lockoutCount24h = 1;
killedBy: AuthService resets the 24h lockout window once it is older than 24 hours
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] BlockStatement
src/services/AuthService.ts:171:14
       if (!lockoutWindowStart || new Date(lockoutWindowStart).getTime() < Date.now() - 24 * 60 * 60 * 1000) {
         lockoutWindowStart = new Date();
         lockoutCount24h = 1;
-      } else {
-        lockoutCount24h += 1;
-      }
+      } else {}
 
       const lockoutMinutes = lockoutCount24h >= 5 ? 24 * 60 : lockoutCount24h >= 3 ? 60 : 15;
killedBy: AuthService extends lockout to 60 minutes when the 24h counter reaches three
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 15

[Killed] AssignmentOperator
src/services/AuthService.ts:172:9
         lockoutWindowStart = new Date();
         lockoutCount24h = 1;
       } else {
-        lockoutCount24h += 1;
+        lockoutCount24h -= 1;
       }
 
killedBy: AuthService extends lockout to 60 minutes when the 24h counter reaches three
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 15

[Killed] EqualityOperator
src/services/AuthService.ts:175:30
         lockoutCount24h += 1;
       }
 
-      const lockoutMinutes = lockoutCount24h >= 5 ? 24 * 60 : lockoutCount24h >= 3 ? 60 : 15;
+      const lockoutMinutes = lockoutCount24h < 5 ? 24 * 60 : lockoutCount24h >= 3 ? 60 : 15;
       lockoutUntil = new Date(Date.now() + lockoutMinutes * 60 * 1000);
     }
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 1440

[Killed] ConditionalExpression
src/services/AuthService.ts:175:30
         lockoutCount24h += 1;
       }
 
-      const lockoutMinutes = lockoutCount24h >= 5 ? 24 * 60 : lockoutCount24h >= 3 ? 60 : 15;
+      const lockoutMinutes = true ? 24 * 60 : lockoutCount24h >= 3 ? 60 : 15;
       lockoutUntil = new Date(Date.now() + lockoutMinutes * 60 * 1000);
     }
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 1440

[Killed] ArithmeticOperator
src/services/AuthService.ts:176:31
       }
 
       const lockoutMinutes = lockoutCount24h >= 5 ? 24 * 60 : lockoutCount24h >= 3 ? 60 : 15;
-      lockoutUntil = new Date(Date.now() + lockoutMinutes * 60 * 1000);
+      lockoutUntil = new Date(Date.now() - lockoutMinutes * 60 * 1000);
     }
 
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: -15

[Killed] ArithmeticOperator
src/services/AuthService.ts:176:44
       }
 
       const lockoutMinutes = lockoutCount24h >= 5 ? 24 * 60 : lockoutCount24h >= 3 ? 60 : 15;
-      lockoutUntil = new Date(Date.now() + lockoutMinutes * 60 * 1000);
+      lockoutUntil = new Date(Date.now() + lockoutMinutes * 60 / 1000);
     }
 
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] ArrayDeclaration
src/services/AuthService.ts:188:7
            lockout_window_start = $6,
            updated_at = NOW()
        WHERE id = $1`,
-      [userId, nextAttempts, nextStatus, lockoutUntil, lockoutCount24h, lockoutWindowStart],
+      [],
     );
 
killedBy: AuthService retries login failure tracking without lockout when attempts stay below threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined
