[Killed] BlockStatement
src/models/ResetRequest.ts:7:42
 export class ResetRequestModel {
   public readonly data: ResetRequest;
 
-  public constructor(data: ResetRequest) {
-    this.data = data;
-  }
+  public constructor(data: ResetRequest) {}
 
   /** Returns whether a reset token can still be used at current time. */
killedBy: ResetRequestModel constructs a model and exposes data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"created_at": 2026-05-11T11:18:28.703Z, "expires_at": 2026-05-11T11:33:28.703Z, "id": 1, "issued_at": 2026-05-11T11:18:28.703Z, "redeemed_by_user_id": null, "reset_token_hash": "hash", "used_at": null, "user_id": 1}
Received: undefined

[Killed] BlockStatement
src/models/ResetRequest.ts:12:39
   }
 
   /** Returns whether a reset token can still be used at current time. */
-  public isUsable(now: Date): boolean {
-    if (this.data.used_at) {
-      return false;
-    }
-    return this.data.expires_at > now;
-  }
+  public isUsable(now: Date): boolean {}
 }
 
killedBy: ResetRequestModel returns true when token is unused and not yet expired
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/models/ResetRequest.ts:13:9
 
   /** Returns whether a reset token can still be used at current time. */
   public isUsable(now: Date): boolean {
-    if (this.data.used_at) {
+    if (true) {
       return false;
     }
killedBy: ResetRequestModel returns true when token is unused and not yet expired
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/models/ResetRequest.ts:13:9
 
   /** Returns whether a reset token can still be used at current time. */
   public isUsable(now: Date): boolean {
-    if (this.data.used_at) {
+    if (false) {
       return false;
     }
killedBy: ResetRequestModel returns false when the token has already been used
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/models/ResetRequest.ts:14:14
   /** Returns whether a reset token can still be used at current time. */
   public isUsable(now: Date): boolean {
     if (this.data.used_at) {
-      return false;
+      return true;
     }
     return this.data.expires_at > now;
killedBy: ResetRequestModel returns false when the token has already been used
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/ResetRequest.ts:16:12
     if (this.data.used_at) {
       return false;
     }
-    return this.data.expires_at > now;
+    return false;
   }
 }
killedBy: ResetRequestModel returns true when token is unused and not yet expired
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/models/ResetRequest.ts:16:12
     if (this.data.used_at) {
       return false;
     }
-    return this.data.expires_at > now;
+    return this.data.expires_at >= now;
   }
 }
killedBy: ResetRequestModel returns false when expires_at equals now exactly (boundary: > not >=)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
