[Killed] BlockStatement
src/models/Session.ts:7:43
 export class SessionModel {
   public readonly data: SessionRecord;
 
-  public constructor(data: SessionRecord) {
-    this.data = data;
-  }
+  public constructor(data: SessionRecord) {}
 
   /** Returns true when session is active and not expired or revoked. */
killedBy: SessionManager behavior via model invariants marks an unrevoked and unexpired session as active
statusReason: TypeError: Cannot read properties of undefined (reading 'revoked_at')

[Killed] BlockStatement
src/models/Session.ts:12:39
   }
 
   /** Returns true when session is active and not expired or revoked. */
-  public isActive(now: Date): boolean {
-    if (this.data.revoked_at) {
-      return false;
-    }
-    return this.data.expires_at > now;
-  }
+  public isActive(now: Date): boolean {}
 }
 
killedBy: SessionManager behavior via model invariants marks an unrevoked and unexpired session as active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/models/Session.ts:13:31
 
   /** Returns true when session is active and not expired or revoked. */
   public isActive(now: Date): boolean {
-    if (this.data.revoked_at) {
-      return false;
-    }
+    if (this.data.revoked_at) {}
     return this.data.expires_at > now;
   }
killedBy: SessionManager behavior via model invariants marks a revoked session as inactive
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/Session.ts:13:9
 
   /** Returns true when session is active and not expired or revoked. */
   public isActive(now: Date): boolean {
-    if (this.data.revoked_at) {
+    if (true) {
       return false;
     }
killedBy: SessionManager behavior via model invariants marks an unrevoked and unexpired session as active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/models/Session.ts:14:14
   /** Returns true when session is active and not expired or revoked. */
   public isActive(now: Date): boolean {
     if (this.data.revoked_at) {
-      return false;
+      return true;
     }
     return this.data.expires_at > now;
killedBy: SessionManager behavior via model invariants marks a revoked session as inactive
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/Session.ts:16:12
     if (this.data.revoked_at) {
       return false;
     }
-    return this.data.expires_at > now;
+    return true;
   }
 }
killedBy: SessionManager behavior via model invariants marks an expired session as inactive
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/models/Session.ts:16:12
     if (this.data.revoked_at) {
       return false;
     }
-    return this.data.expires_at > now;
+    return this.data.expires_at <= now;
   }
 }
killedBy: SessionManager behavior via model invariants marks an unrevoked and unexpired session as active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
