[Survived] StringLiteral
src/services/AuthService.ts:191:50
       [userId, nextAttempts, nextStatus, lockoutUntil, lockoutCount24h, lockoutWindowStart],
     );
 
-    await this.logEvent(userId, 'login_failure', 'failure', correlationId, 'invalid_credentials');
+    await this.logEvent(userId, 'login_failure', "", correlationId, 'invalid_credentials');
     if (nextStatus === 'locked') {
       await this.logEvent(userId, 'lockout_triggered', 'failure', correlationId, 'account_locked');

[Survived] StringLiteral
src/services/AuthService.ts:191:33
       [userId, nextAttempts, nextStatus, lockoutUntil, lockoutCount24h, lockoutWindowStart],
     );
 
-    await this.logEvent(userId, 'login_failure', 'failure', correlationId, 'invalid_credentials');
+    await this.logEvent(userId, "", 'failure', correlationId, 'invalid_credentials');
     if (nextStatus === 'locked') {
       await this.logEvent(userId, 'lockout_triggered', 'failure', correlationId, 'account_locked');

[Killed] BlockStatement
src/services/AuthService.ts:192:34
     );
 
     await this.logEvent(userId, 'login_failure', 'failure', correlationId, 'invalid_credentials');
-    if (nextStatus === 'locked') {
-      await this.logEvent(userId, 'lockout_triggered', 'failure', correlationId, 'account_locked');
-    }
+    if (nextStatus === 'locked') {}
   }
 
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/services/AuthService.ts:192:9
     );
 
     await this.logEvent(userId, 'login_failure', 'failure', correlationId, 'invalid_credentials');
-    if (nextStatus === 'locked') {
+    if (false) {
       await this.logEvent(userId, 'lockout_triggered', 'failure', correlationId, 'account_locked');
     }
killedBy: AuthService locks an account for 15 minutes on the first threshold breach
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
src/services/AuthService.ts:193:56
 
     await this.logEvent(userId, 'login_failure', 'failure', correlationId, 'invalid_credentials');
     if (nextStatus === 'locked') {
-      await this.logEvent(userId, 'lockout_triggered', 'failure', correlationId, 'account_locked');
+      await this.logEvent(userId, 'lockout_triggered', "", correlationId, 'account_locked');
     }
   }

[Killed] BlockStatement
src/services/AuthService.ts:203:20
     status: 'success' | 'failure' | 'pending',
     correlationId: string,
     errorCode: string | null,
-  ): Promise<void> {
-    await dbPool.query(
-      `INSERT INTO auth_events(user_id, event_type, status, error_code, correlation_id)
-       VALUES ($1,$2,$3,$4,$5::uuid)`,
-      [userId, eventType, status, errorCode, correlationId],
-    );
-
-    log('info', 'auth_event', {
-      correlationId,
-      eventType,
-      status,
-      userId: userId ?? undefined,
-      errorCode: errorCode ?? undefined,
-    });
-  }
+  ): Promise<void> {}
 }
 
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/services/AuthService.ts:205:7
     errorCode: string | null,
   ): Promise<void> {
     await dbPool.query(
-      `INSERT INTO auth_events(user_id, event_type, status, error_code, correlation_id)
-       VALUES ($1,$2,$3,$4,$5::uuid)`,
+      ``,
       [userId, eventType, status, errorCode, correlationId],
     );
killedBy: AuthService registers a user after validating the password policy and uniqueness
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "INSERT INTO auth_events"
Received string:    ""

[Survived] StringLiteral
src/services/AuthService.ts:210:17
       [userId, eventType, status, errorCode, correlationId],
     );
 
-    log('info', 'auth_event', {
+    log('info', "", {
       correlationId,
       eventType,

[Survived] ObjectLiteral
src/services/AuthService.ts:210:31
       [userId, eventType, status, errorCode, correlationId],
     );
 
-    log('info', 'auth_event', {
-      correlationId,
-      eventType,
-      status,
-      userId: userId ?? undefined,
-      errorCode: errorCode ?? undefined,
-    });
+    log('info', 'auth_event', {});
   }
 }

[Survived] LogicalOperator
src/services/AuthService.ts:214:15
       correlationId,
       eventType,
       status,
-      userId: userId ?? undefined,
+      userId: userId && undefined,
       errorCode: errorCode ?? undefined,
     });

[Survived] LogicalOperator
src/services/AuthService.ts:215:18
       eventType,
       status,
       userId: userId ?? undefined,
-      errorCode: errorCode ?? undefined,
+      errorCode: errorCode && undefined,
     });
   }
