[Killed] BlockStatement
src/services/CryptoService.ts:10:69
 /** Provides cryptographic operations for password and token handling. */
 export class CryptoService {
   /** Hashes a plaintext password using bcrypt rounds from configuration. */
-  public async hashPassword(plainPassword: string): Promise<string> {
-    return bcrypt.hash(plainPassword, config.bcrypt.rounds);
-  }
+  public async hashPassword(plainPassword: string): Promise<string> {}
 
   /** Compares a plaintext password against a stored bcrypt hash. */
killedBy: AuthService retries login failure tracking without lockout when attempts stay below threshold
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "invalid_credentials"
Received message:   "data and hash arguments required"

      69 |     } else {
      70 |       stryCov_9fa48("209");
    > 71 |       return bcrypt.compare(plainPassword, passwordHash);

[Killed] BlockStatement
src/services/CryptoService.ts:15:94
   }
 
   /** Compares a plaintext password against a stored bcrypt hash. */
-  public async verifyPassword(plainPassword: string, passwordHash: string): Promise<boolean> {
-    return bcrypt.compare(plainPassword, passwordHash);
-  }
+  public async verifyPassword(plainPassword: string, passwordHash: string): Promise<boolean> {}
 
   /** Creates a signed JWT token with 24-hour expiration by default. */
killedBy: AuthService logs in successfully, issues a session, and returns a signed token payload
statusReason: Error: invalid_credentials

[Killed] BlockStatement
src/services/CryptoService.ts:20:74
   }
 
   /** Creates a signed JWT token with 24-hour expiration by default. */
-  public signJwt(payload: Omit<AuthTokenPayload, 'iat' | 'exp'>): string {
-    return jwt.sign(payload, config.jwt.secret, {
-      algorithm: config.jwt.algorithm as jwt.Algorithm,
-      expiresIn: `${config.jwt.expiryHours}h`,
-    });
-  }
+  public signJwt(payload: Omit<AuthTokenPayload, 'iat' | 'exp'>): string {}
 
   /** Verifies a JWT and returns typed token payload. */
killedBy: AuthService logs in successfully, issues a session, and returns a signed token payload
statusReason: TypeError: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Survived] ObjectLiteral
src/services/CryptoService.ts:21:49
 
   /** Creates a signed JWT token with 24-hour expiration by default. */
   public signJwt(payload: Omit<AuthTokenPayload, 'iat' | 'exp'>): string {
-    return jwt.sign(payload, config.jwt.secret, {
-      algorithm: config.jwt.algorithm as jwt.Algorithm,
-      expiresIn: `${config.jwt.expiryHours}h`,
-    });
+    return jwt.sign(payload, config.jwt.secret, {});
   }
 

[Killed] BlockStatement
src/services/CryptoService.ts:28:53
   }
 
   /** Verifies a JWT and returns typed token payload. */
-  public verifyJwt(token: string): AuthTokenPayload {
-    return jwt.verify(token, config.jwt.secret, {
-      algorithms: [config.jwt.algorithm as jwt.Algorithm],
-    }) as AuthTokenPayload;
-  }
+  public verifyJwt(token: string): AuthTokenPayload {}
 
   /** Produces a stable SHA-256 hash for storage of tokens. */
killedBy: AuthService logs in successfully, issues a session, and returns a signed token payload
statusReason: TypeError: Cannot read properties of undefined (reading 'sub')

[Killed] BlockStatement
src/services/CryptoService.ts:35:43
   }
 
   /** Produces a stable SHA-256 hash for storage of tokens. */
-  public hashToken(token: string): string {
-    return crypto.createHash('sha256').update(token).digest('hex');
-  }
+  public hashToken(token: string): string {}
 
   /** Generates a secure random token for password reset links. */
killedBy: PasswordResetService hashes reset tokens deterministically for lookup
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not undefined

[Killed] StringLiteral
src/services/CryptoService.ts:36:61
 
   /** Produces a stable SHA-256 hash for storage of tokens. */
   public hashToken(token: string): string {
-    return crypto.createHash('sha256').update(token).digest('hex');
+    return crypto.createHash('sha256').update(token).digest("");
   }
 
killedBy: CryptoService produces deterministic hash for same token input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: {"data": [108, 161, 61, 82, 202, 112, 200, 131, 224, 240, …], "type": "Buffer"}
Received: serializes to the same string

[Killed] BlockStatement
src/services/CryptoService.ts:40:39
   }
 
   /** Generates a secure random token for password reset links. */
-  public generateResetToken(): string {
-    return crypto.randomBytes(32).toString('hex');
-  }
+  public generateResetToken(): string {}
 
   /** Generates a unique JWT ID for session tracking and revocation. */
killedBy: PasswordResetService generates reset token with expected entropy shape
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Survived] BlockStatement
src/services/CryptoService.ts:45:32
   }
 
   /** Generates a unique JWT ID for session tracking and revocation. */
-  public generateJti(): string {
-    return crypto.randomUUID();
-  }
+  public generateJti(): string {}
 }
 
