[Killed] BlockStatement
src/models/User.ts:7:40
 export class UserModel {
   public readonly data: UserRecord;
 
-  public constructor(data: UserRecord) {
-    this.data = data;
-  }
+  public constructor(data: UserRecord) {}
 
   /** Returns whether the account can currently authenticate. */
killedBy: ProgressiveLockout blocks authentication for a suspended user
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/models/User.ts:12:46
   }
 
   /** Returns whether the account can currently authenticate. */
-  public canAuthenticate(now: Date): boolean {
-    if (this.data.status === 'suspended') {
-      return false;
-    }
-    if (this.data.status === 'locked' && this.data.lockout_until && this.data.lockout_until > now) {
-      return false;
-    }
-    return true;
-  }
+  public canAuthenticate(now: Date): boolean {}
 
   /** Creates an updated user status while preserving other fields. */
killedBy: ProgressiveLockout blocks authentication for a suspended user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/models/User.ts:13:9
 
   /** Returns whether the account can currently authenticate. */
   public canAuthenticate(now: Date): boolean {
-    if (this.data.status === 'suspended') {
+    if (true) {
       return false;
     }
killedBy: ProgressiveLockout allows authentication for an active user with no lockout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/models/User.ts:13:9
 
   /** Returns whether the account can currently authenticate. */
   public canAuthenticate(now: Date): boolean {
-    if (this.data.status === 'suspended') {
+    if (false) {
       return false;
     }
killedBy: ProgressiveLockout blocks authentication for a suspended user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/models/User.ts:14:14
   /** Returns whether the account can currently authenticate. */
   public canAuthenticate(now: Date): boolean {
     if (this.data.status === 'suspended') {
-      return false;
+      return true;
     }
     if (this.data.status === 'locked' && this.data.lockout_until && this.data.lockout_until > now) {
killedBy: ProgressiveLockout blocks authentication for a suspended user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/User.ts:16:9
     if (this.data.status === 'suspended') {
       return false;
     }
-    if (this.data.status === 'locked' && this.data.lockout_until && this.data.lockout_until > now) {
+    if (false) {
       return false;
     }
killedBy: ProgressiveLockout blocks authentication while lockout is active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/models/User.ts:16:9
     if (this.data.status === 'suspended') {
       return false;
     }
-    if (this.data.status === 'locked' && this.data.lockout_until && this.data.lockout_until > now) {
+    if (this.data.status !== 'locked' && this.data.lockout_until && this.data.lockout_until > now) {
       return false;
     }
killedBy: ProgressiveLockout blocks authentication while lockout is active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/models/User.ts:17:14
       return false;
     }
     if (this.data.status === 'locked' && this.data.lockout_until && this.data.lockout_until > now) {
-      return false;
+      return true;
     }
     return true;
killedBy: ProgressiveLockout blocks authentication while lockout is active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/User.ts:23:52
   }
 
   /** Creates an updated user status while preserving other fields. */
-  public withStatus(status: UserStatus): UserModel {
-    return new UserModel({ ...this.data, status });
-  }
+  public withStatus(status: UserStatus): UserModel {}
 }
 
killedBy: UserModel.withStatus returns a new UserModel with the updated status
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: UserModel

Received value has no prototype
Received value: undefined
