[Killed] MethodExpression
src/services/PasswordResetService.ts:20:29
 
   /** Queues reset email for existing account while preserving generic response semantics. */
   public async requestReset(email: string, correlationId: string): Promise<void> {
-    const normalizedEmail = email.trim().toLowerCase();
+    const normalizedEmail = email.toLowerCase();
     const userResult = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
       normalizedEmail,
killedBy: PasswordResetService service behavior queues a reset email and logs success for an existing user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "present@example.com",
+   "  present@example.com  ",

[Killed] MethodExpression
src/services/PasswordResetService.ts:20:29
 
   /** Queues reset email for existing account while preserving generic response semantics. */
   public async requestReset(email: string, correlationId: string): Promise<void> {
-    const normalizedEmail = email.trim().toLowerCase();
+    const normalizedEmail = email.trim().toUpperCase();
     const userResult = await dbPool.query<User>('SELECT * FROM users WHERE email = $1 LIMIT 1', [
       normalizedEmail,
killedBy: PasswordResetService service behavior queues a reset email and logs success for an existing user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "present@example.com",
+   "PRESENT@EXAMPLE.COM",

[Killed] BlockStatement
src/services/PasswordResetService.ts:25:39
       normalizedEmail,
     ]);
 
-    if (userResult.rows.length === 0) {
-      await this.logResetEvent(null, 'reset_request', 'pending', correlationId, null);
-      return;
-    }
+    if (userResult.rows.length === 0) {}
 
     const user = userResult.rows[0];
killedBy: PasswordResetService service behavior logs a pending reset request when the user does not exist
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/services/PasswordResetService.ts:25:9
       normalizedEmail,
     ]);
 
-    if (userResult.rows.length === 0) {
+    if (true) {
       await this.logResetEvent(null, 'reset_request', 'pending', correlationId, null);
       return;
killedBy: PasswordResetService service behavior queues a reset email and logs success for an existing user
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "INSERT INTO reset_requests"
Received string:    "INSERT INTO auth_events(user_id, event_type, status, error_code, correlation_id)
       VALUES ($1,$2,$3,$4,$5::uuid)"

[Survived] ArithmeticOperator
src/services/PasswordResetService.ts:34:32
     const resetToken = this.cryptoService.generateResetToken();
     const tokenHash = this.cryptoService.hashToken(resetToken);
     const issuedAt = new Date();
-    const expiresAt = new Date(issuedAt.getTime() + 15 * 60 * 1000);
+    const expiresAt = new Date(issuedAt.getTime() - 15 * 60 * 1000);
 
     await dbPool.query(

[Survived] ArithmeticOperator
src/services/PasswordResetService.ts:34:53
     const resetToken = this.cryptoService.generateResetToken();
     const tokenHash = this.cryptoService.hashToken(resetToken);
     const issuedAt = new Date();
-    const expiresAt = new Date(issuedAt.getTime() + 15 * 60 * 1000);
+    const expiresAt = new Date(issuedAt.getTime() + 15 / 60 * 1000);
 
     await dbPool.query(

[Survived] ArrayDeclaration
src/services/PasswordResetService.ts:39:7
     await dbPool.query(
       `INSERT INTO reset_requests(user_id, reset_token_hash, issued_at, expires_at)
        VALUES ($1,$2,$3,$4)`,
-      [user.id, tokenHash, issuedAt, expiresAt],
+      [],
     );
 

[Killed] BlockStatement
src/services/PasswordResetService.ts:42:9
       [user.id, tokenHash, issuedAt, expiresAt],
     );
 
-    try {
-      await this.emailService.sendResetEmail({
-        email: user.email,
-        resetToken,
-        correlationId,
-      });
-      await this.logResetEvent(user.id, 'reset_request', 'success', correlationId, null);
-    } catch (error) {
+    try {} catch (error) {
       await this.logResetEvent(user.id, 'reset_email_failed', 'failure', correlationId, 'email_send_failed');
       log('warn', 'reset_email_failed', { correlationId, error: String(error) });
killedBy: PasswordResetService service behavior queues a reset email and logs success for an existing user
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] ObjectLiteral
src/services/PasswordResetService.ts:43:46
     );
 
     try {
-      await this.emailService.sendResetEmail({
-        email: user.email,
-        resetToken,
-        correlationId,
-      });
+      await this.emailService.sendResetEmail({});
       await this.logResetEvent(user.id, 'reset_request', 'success', correlationId, null);
     } catch (error) {

[Killed] BlockStatement
src/services/PasswordResetService.ts:49:21
         correlationId,
       });
       await this.logResetEvent(user.id, 'reset_request', 'success', correlationId, null);
-    } catch (error) {
-      await this.logResetEvent(user.id, 'reset_email_failed', 'failure', correlationId, 'email_send_failed');
-      log('warn', 'reset_email_failed', { correlationId, error: String(error) });
-    }
+    } catch (error) {}
   }
 
killedBy: PasswordResetService service behavior logs a failure when reset email delivery throws
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
src/services/PasswordResetService.ts:50:41
       });
       await this.logResetEvent(user.id, 'reset_request', 'success', correlationId, null);
     } catch (error) {
-      await this.logResetEvent(user.id, 'reset_email_failed', 'failure', correlationId, 'email_send_failed');
+      await this.logResetEvent(user.id, "", 'failure', correlationId, 'email_send_failed');
       log('warn', 'reset_email_failed', { correlationId, error: String(error) });
     }

[Killed] StringLiteral
src/services/PasswordResetService.ts:51:11
       await this.logResetEvent(user.id, 'reset_request', 'success', correlationId, null);
     } catch (error) {
       await this.logResetEvent(user.id, 'reset_email_failed', 'failure', correlationId, 'email_send_failed');
-      log('warn', 'reset_email_failed', { correlationId, error: String(error) });
+      log("", 'reset_email_failed', { correlationId, error: String(error) });
     }
   }
killedBy: PasswordResetService service behavior logs a failure when reset email delivery throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "warn", "reset_email_failed", ObjectContaining {"correlationId": "550e8400-e29b-41d4-a716-446655440022"}
Received: "", "reset_email_failed", {"correlationId": "550e8400-e29b-41d4-a716-446655440022", "error": "Error: smtp down"}

Number of calls: 1

[Killed] ObjectLiteral
src/services/PasswordResetService.ts:51:41
       await this.logResetEvent(user.id, 'reset_request', 'success', correlationId, null);
     } catch (error) {
       await this.logResetEvent(user.id, 'reset_email_failed', 'failure', correlationId, 'email_send_failed');
-      log('warn', 'reset_email_failed', { correlationId, error: String(error) });
+      log('warn', 'reset_email_failed', {});
     }
   }
killedBy: PasswordResetService service behavior logs a failure when reset email delivery throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "warn", "reset_email_failed", ObjectContaining {"correlationId": "550e8400-e29b-41d4-a716-446655440022"}
Received: "warn", "reset_email_failed", {}

Number of calls: 1

[Killed] BlockStatement
src/services/PasswordResetService.ts:56:78
   }
 
   /** Validates reset token against hash, expiry, and single-use conditions. */
-  public async validateResetToken(resetToken: string): Promise<ResetRequest> {
-    const tokenHash = this.cryptoService.hashToken(resetToken);
-    const result = await dbPool.query<ResetRequest>(
-      'SELECT * FROM reset_requests WHERE reset_token_hash = $1 LIMIT 1',
-      [tokenHash],
-    );
-
-    const request = result.rows[0];
-    if (!request) {
-      throw new Error('invalid_reset_token');
-    }
-    if (request.used_at) {
-      throw new Error('reset_token_already_used');
-    }
-    if (new Date(request.expires_at) <= new Date()) {
-      throw new Error('reset_token_expired');
-    }
-
-    return request;
-  }
+  public async validateResetToken(resetToken: string): Promise<ResetRequest> {}
 
   /** Completes password reset and revokes all active sessions for the user. */
killedBy: PasswordResetService service behavior rejects invalid reset tokens before using the password policy
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/services/PasswordResetService.ts:59:7
   public async validateResetToken(resetToken: string): Promise<ResetRequest> {
     const tokenHash = this.cryptoService.hashToken(resetToken);
     const result = await dbPool.query<ResetRequest>(
-      'SELECT * FROM reset_requests WHERE reset_token_hash = $1 LIMIT 1',
+      "",
       [tokenHash],
     );

[Killed] ConditionalExpression
src/services/PasswordResetService.ts:64:9
     );
 
     const request = result.rows[0];
-    if (!request) {
+    if (true) {
       throw new Error('invalid_reset_token');
     }
killedBy: PasswordResetService service behavior rejects already used reset tokens
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "reset_token_already_used"
Received message:   "invalid_reset_token"

      122 |         } else {
      123 |           stryCov_9fa48("299");
    > 124 |           throw new Error(stryMutAct_9fa48("300") ? "" : (stryCov_9fa48("300"), 'invalid_reset_token'));

[Killed] ConditionalExpression
src/services/PasswordResetService.ts:64:9
     );
 
     const request = result.rows[0];
-    if (!request) {
+    if (false) {
       throw new Error('invalid_reset_token');
     }
killedBy: PasswordResetService service behavior rejects invalid reset tokens before using the password policy
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "invalid_reset_token"
Received message:   "Cannot read properties of undefined (reading 'used_at')"

      125 |         }
      126 |       }
    > 127 |       if (stryMutAct_9fa48("302") ? false : stryMutAct_9fa48("301") ? true : (stryCov_9fa48("301", "302"), request.used_at)) {

[Killed] ConditionalExpression
src/services/PasswordResetService.ts:67:9
     if (!request) {
       throw new Error('invalid_reset_token');
     }
-    if (request.used_at) {
+    if (true) {
       throw new Error('reset_token_already_used');
     }
killedBy: PasswordResetService service behavior rejects expired reset tokens
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "reset_token_expired"
Received message:   "reset_token_already_used"

      130 |         } else {
      131 |           stryCov_9fa48("303");
    > 132 |           throw new Error(stryMutAct_9fa48("304") ? "" : (stryCov_9fa48("304"), 'reset_token_already_used'));

[Killed] ConditionalExpression
src/services/PasswordResetService.ts:67:9
     if (!request) {
       throw new Error('invalid_reset_token');
     }
-    if (request.used_at) {
+    if (false) {
       throw new Error('reset_token_already_used');
     }
killedBy: PasswordResetService service behavior rejects already used reset tokens
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"created_at": 2026-05-11T11:20:06.395Z, "expires_at": 2026-05-11T11:35:06.395Z, "id": 1, "issued_at": 2026-05-11T11:20:06.395Z, "redeemed_by_user_id": null, "reset_token_hash": "hash", "used_at": 2026-05-11T11:20:06.395Z, "user_id": 1}

[Killed] ConditionalExpression
src/services/PasswordResetService.ts:70:9
     if (request.used_at) {
       throw new Error('reset_token_already_used');
     }
-    if (new Date(request.expires_at) <= new Date()) {
+    if (true) {
       throw new Error('reset_token_expired');
     }
killedBy: PasswordResetService service behavior completes a reset, revokes sessions, and records success
statusReason: Error: reset_token_expired

[Killed] ConditionalExpression
src/services/PasswordResetService.ts:70:9
     if (request.used_at) {
       throw new Error('reset_token_already_used');
     }
-    if (new Date(request.expires_at) <= new Date()) {
+    if (false) {
       throw new Error('reset_token_expired');
     }
killedBy: PasswordResetService service behavior rejects expired reset tokens
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"created_at": 2026-05-11T11:20:07.053Z, "expires_at": 2026-05-11T11:20:06.053Z, "id": 1, "issued_at": 2026-05-11T11:20:07.053Z, "redeemed_by_user_id": null, "reset_token_hash": "hash", "used_at": null, "user_id": 1}

[Killed] StringLiteral
src/services/PasswordResetService.ts:71:23
       throw new Error('reset_token_already_used');
     }
     if (new Date(request.expires_at) <= new Date()) {
-      throw new Error('reset_token_expired');
+      throw new Error("");
     }
 
killedBy: PasswordResetService service behavior rejects expired reset tokens
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "reset_token_expired"
Received message:   ""

      138 |         } else {
      139 |           stryCov_9fa48("309");
    > 140 |           throw new Error(stryMutAct_9fa48("310") ? "" : (stryCov_9fa48("310"), 'reset_token_expired'));

[Killed] BlockStatement
src/services/PasswordResetService.ts:89:9
     const passwordHash = await this.cryptoService.hashPassword(newPassword);
 
     await dbPool.query('BEGIN');
-    try {
-      await dbPool.query(
-        `UPDATE users
-         SET password_hash = $2,
-             password_changed_at = NOW(),
-             failed_login_attempts = 0,
-             status = 'active',
-             lockout_until = NULL,
-             updated_at = NOW()
-         WHERE id = $1`,
-        [resetRequest.user_id, passwordHash],
-      );
-
-      await dbPool.query(
-        `UPDATE reset_requests
-         SET used_at = NOW(), redeemed_by_user_id = $2
-         WHERE id = $1`,
-        [resetRequest.id, resetRequest.user_id],
-      );
-
-      await this.sessionManager.revokeAllForUser(resetRequest.user_id);
-
-      await dbPool.query('COMMIT');
-    } catch (error) {
+    try {} catch (error) {
       await dbPool.query('ROLLBACK');
       throw error;
killedBy: PasswordResetService service behavior completes a reset, revokes sessions, and records success
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "UPDATE users"
Received string:    "INSERT INTO auth_events(user_id, event_type, status, error_code, correlation_id)
       VALUES ($1,$2,$3,$4,$5::uuid)"

[Killed] StringLiteral
src/services/PasswordResetService.ts:103:9
       );
 
       await dbPool.query(
-        `UPDATE reset_requests
-         SET used_at = NOW(), redeemed_by_user_id = $2
-         WHERE id = $1`,
+        ``,
         [resetRequest.id, resetRequest.user_id],
       );
killedBy: PasswordResetService service behavior completes a reset, revokes sessions, and records success
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "UPDATE reset_requests"
Received string:    ""

[Survived] ArrayDeclaration
src/services/PasswordResetService.ts:106:9
         `UPDATE reset_requests
          SET used_at = NOW(), redeemed_by_user_id = $2
          WHERE id = $1`,
-        [resetRequest.id, resetRequest.user_id],
+        [],
       );
 

[Killed] StringLiteral
src/services/PasswordResetService.ts:111:26
 
       await this.sessionManager.revokeAllForUser(resetRequest.user_id);
 
-      await dbPool.query('COMMIT');
+      await dbPool.query("");
     } catch (error) {
       await dbPool.query('ROLLBACK');
killedBy: PasswordResetService service behavior completes a reset, revokes sessions, and records success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "COMMIT"
Received: ""

[Killed] BlockStatement
src/services/PasswordResetService.ts:112:21
       await this.sessionManager.revokeAllForUser(resetRequest.user_id);
 
       await dbPool.query('COMMIT');
-    } catch (error) {
-      await dbPool.query('ROLLBACK');
-      throw error;
-    }
+    } catch (error) {}
 
     await this.logResetEvent(resetRequest.user_id, 'reset_completed', 'success', correlationId, null);
killedBy: PasswordResetService service behavior rolls back a reset when updating the user fails
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"userId": 88}

[Killed] ObjectLiteral
src/services/PasswordResetService.ts:118:12
     }
 
     await this.logResetEvent(resetRequest.user_id, 'reset_completed', 'success', correlationId, null);
-    return { userId: resetRequest.user_id };
+    return {};
   }
 
killedBy: PasswordResetService service behavior completes a reset, revokes sessions, and records success
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "userId": 77,
- }

[Killed] BlockStatement
src/services/PasswordResetService.ts:122:56
   }
 
   /** Deletes stale reset requests older than seven days past expiry. */
-  public async cleanupExpiredTokens(): Promise<number> {
-    const result = await dbPool.query(
-      `DELETE FROM reset_requests
-       WHERE expires_at < NOW() - INTERVAL '7 days'`,
-    );
-    return result.rowCount ?? 0;
-  }
+  public async cleanupExpiredTokens(): Promise<number> {}
 
   private async logResetEvent(
killedBy: PasswordResetService service behavior removes expired reset tokens older than seven days past expiry
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] StringLiteral
src/services/PasswordResetService.ts:124:7
   /** Deletes stale reset requests older than seven days past expiry. */
   public async cleanupExpiredTokens(): Promise<number> {
     const result = await dbPool.query(
-      `DELETE FROM reset_requests
-       WHERE expires_at < NOW() - INTERVAL '7 days'`,
+      ``,
     );
     return result.rowCount ?? 0;
killedBy: PasswordResetService service behavior removes expired reset tokens older than seven days past expiry
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "DELETE FROM reset_requests"
Received string:    ""

[Killed] BlockStatement
src/services/PasswordResetService.ts:136:20
     status: 'success' | 'failure' | 'pending',
     correlationId: string,
     errorCode: string | null,
-  ): Promise<void> {
-    await dbPool.query(
-      `INSERT INTO auth_events(user_id, event_type, status, error_code, correlation_id)
-       VALUES ($1,$2,$3,$4,$5::uuid)`,
-      [userId, eventType, status, errorCode, correlationId],
-    );
-  }
+  ): Promise<void> {}
 }
 
killedBy: PasswordResetService service behavior logs a pending reset request when the user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1
