[Killed] ConditionalExpression
src/services/EmailService.ts:14:5
 /** Handles email delivery with retry semantics for reset flows. */
 export class EmailService {
   private readonly transporter =
-    config.email.provider === 'smtp'
+    true
       ? nodemailer.createTransport({
           host: config.email.smtpHost,
killedBy: EmailService queues the test-provider email with an exact log payload and no SMTP transport
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"auth": undefined, "host": "", "port": 587}

[Killed] EqualityOperator
src/services/EmailService.ts:14:5
 /** Handles email delivery with retry semantics for reset flows. */
 export class EmailService {
   private readonly transporter =
-    config.email.provider === 'smtp'
+    config.email.provider !== 'smtp'
       ? nodemailer.createTransport({
           host: config.email.smtpHost,
killedBy: EmailService queues the test-provider email with an exact log payload and no SMTP transport
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"auth": undefined, "host": "", "port": 587}

[Killed] ConditionalExpression
src/services/EmailService.ts:19:13
           host: config.email.smtpHost,
           port: config.email.smtpPort,
           auth:
-            config.email.smtpUser && config.email.smtpPassword
+            false
               ? {
                   user: config.email.smtpUser,
killedBy: EmailService SMTP branch creates an SMTP transport and sends mail when provider is smtp
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "auth": Object {
-     "pass": "smtp-pass",

[Survived] LogicalOperator
src/services/EmailService.ts:19:13
           host: config.email.smtpHost,
           port: config.email.smtpPort,
           auth:
-            config.email.smtpUser && config.email.smtpPassword
+            config.email.smtpUser || config.email.smtpPassword
               ? {
                   user: config.email.smtpUser,

[Killed] ConditionalExpression
src/services/EmailService.ts:33:12
     const maxRetries = config.email.maxRetries;
     let attempt = 0;
 
-    while (attempt < maxRetries) {
+    while (false) {
       attempt += 1;
       try {
killedBy: EmailService SMTP branch creates an SMTP transport and sends mail when provider is smtp
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
src/services/EmailService.ts:33:12
     const maxRetries = config.email.maxRetries;
     let attempt = 0;
 
-    while (attempt < maxRetries) {
+    while (attempt >= maxRetries) {
       attempt += 1;
       try {
killedBy: EmailService SMTP branch creates an SMTP transport and sends mail when provider is smtp
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Timeout] AssignmentOperator
src/services/EmailService.ts:34:7
     let attempt = 0;
 
     while (attempt < maxRetries) {
-      attempt += 1;
+      attempt -= 1;
       try {
         if (config.email.provider === 'test') {

[Killed] EqualityOperator
src/services/EmailService.ts:36:13
     while (attempt < maxRetries) {
       attempt += 1;
       try {
-        if (config.email.provider === 'test') {
+        if (config.email.provider !== 'test') {
           log('info', 'reset_email_queued_test_provider', {
             correlationId: payload.correlationId,
killedBy: EmailService SMTP branch creates an SMTP transport and sends mail when provider is smtp
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/EmailService.ts:36:47
     while (attempt < maxRetries) {
       attempt += 1;
       try {
-        if (config.email.provider === 'test') {
-          log('info', 'reset_email_queued_test_provider', {
-            correlationId: payload.correlationId,
-            email: payload.email,
-            resetToken: payload.resetToken,
-            attempt,
-          });
-          return;
-        }
+        if (config.email.provider === 'test') {}
 
         if (!this.transporter) {
killedBy: EmailService queues the test-provider email with an exact log payload and no SMTP transport
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [Error: SMTP transporter is not configured]

[Killed] StringLiteral
src/services/EmailService.ts:37:15
       attempt += 1;
       try {
         if (config.email.provider === 'test') {
-          log('info', 'reset_email_queued_test_provider', {
+          log("", 'reset_email_queued_test_provider', {
             correlationId: payload.correlationId,
             email: payload.email,
killedBy: EmailService queues the test-provider email with an exact log payload and no SMTP transport
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "info",
+ "",
  "reset_email_queued_test_provider",

[Killed] ObjectLiteral
src/services/EmailService.ts:37:59
       attempt += 1;
       try {
         if (config.email.provider === 'test') {
-          log('info', 'reset_email_queued_test_provider', {
-            correlationId: payload.correlationId,
-            email: payload.email,
-            resetToken: payload.resetToken,
-            attempt,
-          });
+          log('info', 'reset_email_queued_test_provider', {});
           return;
         }
killedBy: EmailService queues the test-provider email with an exact log payload and no SMTP transport
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "info",
  "reset_email_queued_test_provider",
- Object {

[Killed] BlockStatement
src/services/EmailService.ts:46:32
           return;
         }
 
-        if (!this.transporter) {
-          throw new Error('SMTP transporter is not configured');
-        }
+        if (!this.transporter) {}
 
         await this.transporter.sendMail({
killedBy: EmailService SMTP branch throws when smtp transport cannot be created
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "SMTP transporter is not configured"
Received message:   "Cannot read properties of null (reading 'sendMail')"

      106 |                 }
      107 |               }
    > 108 |               await this.transporter.sendMail(stryMutAct_9fa48("249") ? {} : (stryCov_9fa48("249"), {

[Killed] BooleanLiteral
src/services/EmailService.ts:46:13
           return;
         }
 
-        if (!this.transporter) {
+        if (this.transporter) {
           throw new Error('SMTP transporter is not configured');
         }
killedBy: EmailService SMTP branch creates an SMTP transport and sends mail when provider is smtp
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [Error: SMTP transporter is not configured]

[Killed] ObjectLiteral
src/services/EmailService.ts:50:41
           throw new Error('SMTP transporter is not configured');
         }
 
-        await this.transporter.sendMail({
-          from: config.email.from,
-          to: payload.email,
-          subject: 'Reset your password',
-          text: `Use this reset token within 15 minutes: ${payload.resetToken}`,
-        });
+        await this.transporter.sendMail({});
 
         log('info', 'reset_email_sent', {
killedBy: EmailService SMTP branch creates an SMTP transport and sends mail when provider is smtp
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"from": "noreply@example.com", "subject": "Reset your password", "to": "user@example.com"}
Received: {}

Number of calls: 1

[Survived] ObjectLiteral
src/services/EmailService.ts:57:41
           text: `Use this reset token within 15 minutes: ${payload.resetToken}`,
         });
 
-        log('info', 'reset_email_sent', {
-          correlationId: payload.correlationId,
-          email: payload.email,
-          attempt,
-        });
+        log('info', 'reset_email_sent', {});
         return;
       } catch (error) {

[Killed] BlockStatement
src/services/EmailService.ts:63:23
           attempt,
         });
         return;
-      } catch (error) {
-        log('warn', 'reset_email_send_failed', {
-          correlationId: payload.correlationId,
-          email: payload.email,
-          attempt,
-          error: String(error),
-        });
-        if (attempt >= maxRetries) {
-          throw error;
-        }
-        await new Promise<void>((resolve) => {
-          setTimeout(resolve, attempt * 200);
-        });
-      }
+      } catch (error) {}
     }
   }
killedBy: EmailService SMTP branch retries SMTP failures exactly three times and surfaces the last error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/services/EmailService.ts:64:13
         });
         return;
       } catch (error) {
-        log('warn', 'reset_email_send_failed', {
+        log("", 'reset_email_send_failed', {
           correlationId: payload.correlationId,
           email: payload.email,

[Killed] ConditionalExpression
src/services/EmailService.ts:70:13
           attempt,
           error: String(error),
         });
-        if (attempt >= maxRetries) {
+        if (false) {
           throw error;
         }
killedBy: EmailService SMTP branch retries SMTP failures exactly three times and surfaces the last error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/services/EmailService.ts:70:13
           attempt,
           error: String(error),
         });
-        if (attempt >= maxRetries) {
+        if (attempt > maxRetries) {
           throw error;
         }
killedBy: EmailService SMTP branch retries SMTP failures exactly three times and surfaces the last error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/EmailService.ts:73:46
         if (attempt >= maxRetries) {
           throw error;
         }
-        await new Promise<void>((resolve) => {
-          setTimeout(resolve, attempt * 200);
-        });
+        await new Promise<void>((resolve) => {});
       }
     }
killedBy: EmailService SMTP branch retries SMTP failures exactly three times and surfaces the last error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArithmeticOperator
src/services/EmailService.ts:74:31
           throw error;
         }
         await new Promise<void>((resolve) => {
-          setTimeout(resolve, attempt * 200);
+          setTimeout(resolve, attempt / 200);
         });
       }
killedBy: EmailService SMTP branch retries SMTP failures exactly three times and surfaces the last error
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: Any<Function>, 200
Received
->     1: [Function anonymous], 0.005
       2: [Function anonymous], 0.01
