[Killed] BlockStatement
src/services/SessionManager.ts:13:24
     tokenHash: string;
     ipAddress: string | null;
     userAgent: string | null;
-  }): Promise<Session> {
-    const issuedAt = new Date();
-    const expiresAt = new Date(issuedAt.getTime() + 24 * 60 * 60 * 1000);
-
-    const result = await dbPool.query<Session>(
-      `INSERT INTO sessions(user_id, jti, token_hash, issued_at, expires_at, ip_address, user_agent)
-       VALUES ($1,$2,$3,$4,$5,$6,$7)
-       RETURNING *`,
-      [
-        params.userId,
-        params.jti,
-        params.tokenHash,
-        issuedAt,
-        expiresAt,
-        params.ipAddress,
-        params.userAgent,
-      ],
-    );
-    return result.rows[0];
-  }
+  }): Promise<Session> {}
 
   /** Fetches and validates a session by jti ensuring not expired and not revoked. */
killedBy: SessionManager service behavior issues a session record with a 24-hour expiry
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"created_at": 2026-05-11T10:00:00.000Z, "expires_at": 2026-05-12T10:00:00.000Z, "id": 9, "ip_address": "127.0.0.1", "issued_at": 2026-05-11T10:00:00.000Z, "jti": "issued-jti", "revoked_at": null, "token_hash": "issued-token-hash", "user_agent": "jest", "user_id": 9}
Received: undefined

[Killed] ArithmeticOperator
src/services/SessionManager.ts:15:53
     userAgent: string | null;
   }): Promise<Session> {
     const issuedAt = new Date();
-    const expiresAt = new Date(issuedAt.getTime() + 24 * 60 * 60 * 1000);
+    const expiresAt = new Date(issuedAt.getTime() + 24 * 60 / 60 * 1000);
 
     const result = await dbPool.query<Session>(
killedBy: SessionManager service behavior inserts expires_at exactly 24 hours after issued_at
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 86400000
Received: 24000

[Killed] ArithmeticOperator
src/services/SessionManager.ts:15:53
     userAgent: string | null;
   }): Promise<Session> {
     const issuedAt = new Date();
-    const expiresAt = new Date(issuedAt.getTime() + 24 * 60 * 60 * 1000);
+    const expiresAt = new Date(issuedAt.getTime() + 24 * 60 * 60 / 1000);
 
     const result = await dbPool.query<Session>(
killedBy: SessionManager service behavior inserts expires_at exactly 24 hours after issued_at
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 86400000
Received: 86

[Killed] ArrayDeclaration
src/services/SessionManager.ts:21:7
       `INSERT INTO sessions(user_id, jti, token_hash, issued_at, expires_at, ip_address, user_agent)
        VALUES ($1,$2,$3,$4,$5,$6,$7)
        RETURNING *`,
-      [
-        params.userId,
-        params.jti,
-        params.tokenHash,
-        issuedAt,
-        expiresAt,
-        params.ipAddress,
-        params.userAgent,
-      ],
+      [],
     );
     return result.rows[0];
killedBy: SessionManager service behavior issues a session record with a 24-hour expiry
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: undefined

[Killed] BlockStatement
src/services/SessionManager.ts:35:70
   }
 
   /** Fetches and validates a session by jti ensuring not expired and not revoked. */
-  public async validateSession(jti: string): Promise<Session | null> {
-    const result = await dbPool.query<Session>('SELECT * FROM sessions WHERE jti = $1 LIMIT 1', [jti]);
-    const session = result.rows[0];
-    if (!session) {
-      return null;
-    }
-
-    const now = new Date();
-    if (session.revoked_at || new Date(session.expires_at) <= now) {
-      return null;
-    }
-
-    return session;
-  }
+  public async validateSession(jti: string): Promise<Session | null> {}
 
   /** Revokes one session by jti by stamping revoked_at and writing an auth event. */
killedBy: SessionManager service behavior returns null when a session cannot be found
statusReason: Error: expect(received).resolves.toBeNull()

Received: undefined

[Survived] StringLiteral
src/services/SessionManager.ts:36:48
 
   /** Fetches and validates a session by jti ensuring not expired and not revoked. */
   public async validateSession(jti: string): Promise<Session | null> {
-    const result = await dbPool.query<Session>('SELECT * FROM sessions WHERE jti = $1 LIMIT 1', [jti]);
+    const result = await dbPool.query<Session>("", [jti]);
     const session = result.rows[0];
     if (!session) {

[Killed] ConditionalExpression
src/services/SessionManager.ts:38:9
   public async validateSession(jti: string): Promise<Session | null> {
     const result = await dbPool.query<Session>('SELECT * FROM sessions WHERE jti = $1 LIMIT 1', [jti]);
     const session = result.rows[0];
-    if (!session) {
+    if (true) {
       return null;
     }
killedBy: SessionManager service behavior returns the active session when it is valid
statusReason: Error: expect(received).resolves.toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: null

[Killed] ConditionalExpression
src/services/SessionManager.ts:38:9
   public async validateSession(jti: string): Promise<Session | null> {
     const result = await dbPool.query<Session>('SELECT * FROM sessions WHERE jti = $1 LIMIT 1', [jti]);
     const session = result.rows[0];
-    if (!session) {
+    if (false) {
       return null;
     }
killedBy: SessionManager service behavior returns null when a session cannot be found
statusReason: Error: expect(received).resolves.toBeNull()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'revoked_at')]

[Killed] ConditionalExpression
src/services/SessionManager.ts:43:9
     }
 
     const now = new Date();
-    if (session.revoked_at || new Date(session.expires_at) <= now) {
+    if (false) {
       return null;
     }
killedBy: SessionManager service behavior returns null for revoked sessions
statusReason: Error: expect(received).resolves.toBeNull()

Received: {"created_at": 2026-05-11T11:20:14.872Z, "expires_at": 2026-05-11T12:20:14.872Z, "id": 1, "ip_address": "127.0.0.1", "issued_at": 2026-05-11T11:20:14.872Z, "jti": "test-jti", "revoked_at": 2026-05-11T11:20:14.872Z, "token_hash": "hash", "user_agent": "jest", "user_id": 1}

[Killed] EqualityOperator
src/services/SessionManager.ts:43:31
     }
 
     const now = new Date();
-    if (session.revoked_at || new Date(session.expires_at) <= now) {
+    if (session.revoked_at || new Date(session.expires_at) > now) {
       return null;
     }
killedBy: SessionManager service behavior returns null for expired sessions
statusReason: Error: expect(received).resolves.toBeNull()

Received: {"created_at": 2026-05-11T11:20:15.768Z, "expires_at": 2026-05-11T11:20:14.768Z, "id": 1, "ip_address": "127.0.0.1", "issued_at": 2026-05-11T11:20:15.768Z, "jti": "test-jti", "revoked_at": null, "token_hash": "hash", "user_agent": "jest", "user_id": 1}

[Killed] BlockStatement
src/services/SessionManager.ts:54:20
   public async revokeSession(
     jti: string,
     opts?: { userId?: number; correlationId?: string },
-  ): Promise<void> {
-    const updated = await dbPool.query<Session>(
-      'UPDATE sessions SET revoked_at = NOW() WHERE jti = $1 AND revoked_at IS NULL RETURNING *',
-      [jti],
-    );
-
-    if (updated.rows.length === 0) {
-      return;
-    }
-
-    const userId = opts?.userId ?? updated.rows[0].user_id;
-    const correlationId = opts?.correlationId;
-    if (correlationId) {
-      await dbPool.query(
-        `INSERT INTO auth_events(user_id, event_type, status, correlation_id)
-         VALUES ($1, 'session_revoked', 'success', $2::uuid)`,
-        [userId, correlationId],
-      );
-    }
-  }
+  ): Promise<void> {}
 
   /** Revokes all sessions for a specific user. */
killedBy: SessionManager service behavior returns early when revoking a missing session
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ArrayDeclaration
src/services/SessionManager.ts:57:7
   ): Promise<void> {
     const updated = await dbPool.query<Session>(
       'UPDATE sessions SET revoked_at = NOW() WHERE jti = $1 AND revoked_at IS NULL RETURNING *',
-      [jti],
+      [],
     );
 

[Killed] BlockStatement
src/services/SessionManager.ts:60:36
       [jti],
     );
 
-    if (updated.rows.length === 0) {
-      return;
-    }
+    if (updated.rows.length === 0) {}
 
     const userId = opts?.userId ?? updated.rows[0].user_id;
killedBy: SessionManager service behavior returns early when revoking a missing session
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/services/SessionManager.ts:60:9
       [jti],
     );
 
-    if (updated.rows.length === 0) {
+    if (false) {
       return;
     }
killedBy: SessionManager service behavior returns early when revoking a missing session
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] LogicalOperator
src/services/SessionManager.ts:64:20
       return;
     }
 
-    const userId = opts?.userId ?? updated.rows[0].user_id;
+    const userId = opts?.userId && updated.rows[0].user_id;
     const correlationId = opts?.correlationId;
     if (correlationId) {
killedBy: SessionManager service behavior uses user_id from DB row when opts.userId is not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 77
Received: undefined

[Killed] OptionalChaining
src/services/SessionManager.ts:64:20
       return;
     }
 
-    const userId = opts?.userId ?? updated.rows[0].user_id;
+    const userId = opts.userId ?? updated.rows[0].user_id;
     const correlationId = opts?.correlationId;
     if (correlationId) {
killedBy: SessionManager service behavior revokes a session without throwing when opts is undefined
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'userId')]

[Killed] OptionalChaining
src/services/SessionManager.ts:65:27
     }
 
     const userId = opts?.userId ?? updated.rows[0].user_id;
-    const correlationId = opts?.correlationId;
+    const correlationId = opts.correlationId;
     if (correlationId) {
       await dbPool.query(
killedBy: SessionManager service behavior revokes a session without throwing when opts is undefined
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'correlationId')]

[Killed] BlockStatement
src/services/SessionManager.ts:66:24
 
     const userId = opts?.userId ?? updated.rows[0].user_id;
     const correlationId = opts?.correlationId;
-    if (correlationId) {
-      await dbPool.query(
-        `INSERT INTO auth_events(user_id, event_type, status, correlation_id)
-         VALUES ($1, 'session_revoked', 'success', $2::uuid)`,
-        [userId, correlationId],
-      );
-    }
+    if (correlationId) {}
   }
 
killedBy: SessionManager service behavior revokes a session and logs an auth event when a correlation id is present
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/services/SessionManager.ts:66:9
 
     const userId = opts?.userId ?? updated.rows[0].user_id;
     const correlationId = opts?.correlationId;
-    if (correlationId) {
+    if (true) {
       await dbPool.query(
         `INSERT INTO auth_events(user_id, event_type, status, correlation_id)
killedBy: SessionManager service behavior revokes a session without writing an auth event when no correlation id is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/services/SessionManager.ts:76:64
   }
 
   /** Revokes all sessions for a specific user. */
-  public async revokeAllForUser(userId: number): Promise<void> {
-    await dbPool.query('UPDATE sessions SET revoked_at = NOW() WHERE user_id = $1 AND revoked_at IS NULL', [
-      userId,
-    ]);
-  }
+  public async revokeAllForUser(userId: number): Promise<void> {}
 }
 
killedBy: PasswordResetService service behavior completes a reset, revokes sessions, and records success
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "UPDATE sessions SET revoked_at"
Received string:    "COMMIT"

[Killed] ArrayDeclaration
src/services/SessionManager.ts:77:108
 
   /** Revokes all sessions for a specific user. */
   public async revokeAllForUser(userId: number): Promise<void> {
-    await dbPool.query('UPDATE sessions SET revoked_at = NOW() WHERE user_id = $1 AND revoked_at IS NULL', [
-      userId,
-    ]);
+    await dbPool.query('UPDATE sessions SET revoked_at = NOW() WHERE user_id = $1 AND revoked_at IS NULL', []);
   }
 }
killedBy: SessionManager service behavior revokes all active sessions for a user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   44,
- ]
